UKS/src/DataProcessors/ТелеграмБот/ТелеграмБот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТелеграмБот</name>
  <comment>Телеграм бот</comment>
  <attributes>
    <name>Бот</name>
    <comment>Бот</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <comment>Токен</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <comment>Сервер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

UKS/src/DataProcessors/ТелеграмБот/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Бот = Константы.Бот.Получить();
	Объект.Токен = Константы.Токен.Получить();
	Объект.Сервер = Константы.Сервер.Получить();
	//ПодключитьОбработчикОжидания("Автомат",5);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеБоту()
	
	
	
КонецПроцедуры	

&НаСервере
Процедура getUpdatesНаСервере()
	
	Результат = SDK_Telegram.ПолучитьСпиокСообщений();
	РезультатЗапроса = SDK_Telegram.СформироватьJSON(Результат,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура getUpdates(Команда)
	getUpdatesНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапускФоновыхЗаданий(Команда)
	
	ПодключитьОбработчикОжидания("Автомат",5);
	
КонецПроцедуры

&НаКлиенте
Процедура Автомат()
	
	getUpdatesНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Автомат",5);
	
КонецПроцедуры
